---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.DataStorage.Create(Autodesk.Revit.DB.Document)
zh: 创建、新建、生成、建立、新增
source: html/8051ae69-476d-209d-c83c-148bafd6e43c.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.DataStorage.Create Method

**中文**: 创建、新建、生成、建立、新增

Creates a new DataStorage element and adds it to the document.

## Syntax (C#)
```csharp
public static DataStorage Create(
	Document doc
)
```

## Parameters
- **doc** (`Autodesk.Revit.DB.Document`) - Document to which the new element should be added.

## Returns
The newly created DataStorage element.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null